Revit 2027 API
BuiltInFailures.SketchFailures.SketchWasDeleted Property
 Sketch was deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchWasDeleted { get; }
Public Shared ReadOnly Property SketchWasDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchWasDeleted {
	FailureDefinitionId^ get ();
}
static member SketchWasDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace